app/controllers/user_controller.rb

 def index
    if !current_user.is_admin?
      flash[:error] = 'Not authorized'
      redirect_to root_path
    end

    @users = User.all
---
SELECT "users".* FROM "users"